Revit 2024 API
BuiltInFailures.AutoRouteFailures.SegmentDrawnFromWrongSideWarning Property
 The segment is being drawn from the wrong side to connect to the location you indicated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SegmentDrawnFromWrongSideWarning { get; }
Visual Basic
Public Shared ReadOnly Property SegmentDrawnFromWrongSideWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SegmentDrawnFromWrongSideWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace